text1_intro = '''Добро пожаловать на тест по правилам дорожного движения!Этот тест поможет проверить ваши знания ПДД — от базовых понятий до сложных дорожных ситуаций. Ответьте на вопросы, чтобы оценить уровень подготовки и выявить темы, требующие дополнительного изучения.
Нажмите «Начать тест», чтобы приступить.'''
text2_button = 'Начать тест'
text3_title = 'тест'
text4_outro = '''Ура, вы прошли тест по ПДД! Спасибо, что уделили время — это отличный шаг к более безопасному движению на дорогах. Посмотрите свои результаты: даже если где‑то были ошибки, теперь вы знаете, что подтянуть.
Пусть ваши поездки будут комфортными и безопасными! Хорошего дня!'''
text5_button = 'Завершить'
win_width = 1000
win_height = 600
win_x = 200
win_y = 100
question1 = '''Вы поворачиваете налево на регулируемом перекрёстке при зелёном сигнале светофора. Кому вы обязаны уступить дорогу?'''
answer1_1 = 'Только пешеходам'
answer1_2 = 'Только встречным автомобилям'
answer1_3 = 'Пешеходам и встречным автомобилям'
answer1_4 = 'Никому'
question2 = '''Разрешена ли остановка автомобиля ближе 5 метров перед пешеходным переходом?'''
answer2_1 = 'Да'
answer2_2 = 'Нет'
answer2_3 = 'Только ночью'
answer2_4 = 'Только при включенной аварийке'
question3 = '''В каком случае запрещён обгон?'''
answer3_1 = 'На пешеходном переходе'
answer3_2 = 'На мосту'
answer3_3 = 'На железнодорожном переезде'
answer3_4 = 'Во всех перечисленных случаях'
